//Составьте программу, которая напечатает рисунок, используя символы из таблицы ASCII
//Преобразовать код символа в символ типа char можно, методом преобразования целого значения в символьное.
// пример преобразования ASCII кода 187 в соответствующий символ    char(187)
//http://cppstudio.com/post/276//
#include <iostream>
using namespace std;
int main()
{
    cout<<char(99)<<endl ;
    cout<<char(100)<<endl ;
        cout<<char(164)<<endl ;
    return 0;
}
