#include "stdafx.h"
#include <iostream>

using namespace std;

int main()
{
	// На 9-й строке создаем двумерный массив с именем  arr типа int размерностью 3 на 3 и на 3 элемента.
	int arr[3][3][3];


	// Заполняем массив.
	arr[0][0][0] = 1;
	arr[0][0][1] = 2;
	arr[0][0][2] = 3;
	arr[0][1][0] = 4;
	arr[0][1][1] = 5;
	arr[0][1][2] = 6;
	arr[0][2][0] = 7;
	arr[0][2][1] = 8;
	arr[0][2][2] = 9;

	arr[1][0][0] = 1;
	arr[1][0][1] = 2;
	arr[1][0][2] = 3;
	arr[1][1][0] = 4;
	arr[1][1][1] = 5;
	arr[1][1][2] = 6;
	arr[1][2][0] = 7;
	arr[1][2][1] = 8;
	arr[1][2][2] = 9;

	arr[2][0][0] = 1;
	arr[2][0][1] = 2;
	arr[2][0][2] = 3;
	arr[2][1][0] = 4;
	arr[2][1][1] = 5;
	arr[2][1][2] = 6;
	arr[2][2][0] = 7;
	arr[2][2][1] = 8;
	arr[2][2][2] = 9;



	// Выводим значения массива в консоль.
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 3; k++)
			{
				cout << arr[i][j][k] << " ";
			}
			cout << endl;
		}
		cout << endl;
	}

	system("pause");
	return 0;
}

