#include "stdafx.h"
#include <iostream>

using namespace std;
/*
	ѕобитовое » Ц это бинарна€ операци€, действие которой эквивалентно применению логического » к каждой паре битов,
	которые сто€т на одинаковых позици€х в двоичных представлени€х операндов.


				-------------------------
				|	a	|	b	|	&	|
				-------------------------
				|   0	|   0	|   0	|
				-------------------------
				|   0	|   1	|   0	|
				-------------------------
				|   1	|   0	|   0	|
				-------------------------
				|   1	|   1	|   1	|
				-------------------------
*/

int main()
{
	int a = 9;					// ... 0000 1001
	int b = 5;					// ... 0000 0101

	int result = a & b;			// ... 0000 0001 = 1

	cout << result << endl;

	return 0;
}