// Составить программу, которая будет считывать введённое пятизначное число. После чего, каждую цифру этого числа необходимо вывести в новой строке.

#include <iostream>

using namespace std;

int main()
{
    int num = 0;
    cout << "Enter 5-digit number" << endl;
    cin>>num;
    if (num>=0 && (num <= 9999 || num>=100000)) {
        cout<<"Вы ввели неверное число. Число должно быть пятизначным.\n\n";
    }
    else {

    int d1,d2,d3,d4,d5;
    d5 = num % 10;
    d4 = (num - d5) % 100/10 ;
    d3 = (num - d4*10 - d5) % 1000/100;
    d2 = (num - d3*100 - d4*10 - d5) %10000/1000;
    d1 = (num - d2*1000 - d3*100 - d4*10 - d5) % 100000/10000;
    cout<<"d1="<<d1<<endl;
    cout<<"d2="<<d2<<endl;
    cout<<"d3="<<d3<<endl;
    cout<<"d4="<<d4<<endl;
    cout<<"d5="<<d5<<endl;

    cout<<"1 цифра равна "<<(num/10000)<<"\n";
    cout<<"2 цифра равна "<<(num/1000)%10<<"\n";
    cout<<"3 цифра равна "<<(num/100)%10<<"\n";
    cout<<"4 цифра равна "<<(num/10)%10<<"\n";
    cout<<"5 цифра равна "<<num%10<<"\n";


    return 0;
    }
}

